app/controllers/properties_controller.rb

SELECT `properties`.* FROM `properties`
---
  def index
    @properties = Property.all

INSERT INTO "properties" ("title", "location", "description", "publish", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "xx"], ["location", "xx"], ["description", "xx"], ["publish", "xx"], ["created_at", 2017-01-14 00:29:53 UTC], ["updated_at", 2017-01-14 00:29:53 UTC]]
---
  def create
    @property = Property.new(property_params)

    respond_to do |format|
      if @property.save

DELETE FROM `properties` WHERE `properties`.`id` = 1
---
  def destroy
    @property.destroy

SELECT  "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_property
      @property = Property.find(params[:id])